let data = ['Засгийн', 'газарт', '6.4', 'сая', 'тонн', 'нүүрс', 'алдагдсан', 'гэх', 'мэдээлэл', 'ирээгүй', 'байна.', 'Бодит', 'байдалд', 'ийм', 'их', 'хэмжээний', 'нүүрс', 'алдагдсан', 'гэх', 'асуудал', 'эргэлзээтэй', 'байна.', 'Хууль', 'хяналтын', 'байгууллага', 'хяналт', 'шалгалтын', 'ажил', 'явуулж', 'байна'];
let count = prompt('Ugee bichine uu?');
let count2 = 0;
for(i = 0; i < data.length - 1; i++){
    if(count === data[i]){
        count2 = count2 + 1;
    }
}
console.log(count + ' ' + 'gesen ug' + ' ' + count2 + ' ' + 'orson baina.');